Revit 2027 API
Document.NewFlexPipe(Connector, Connector, FlexPipeType) Method
Adds a new flexible pipe into the document, using two connector, and flexible pipe type.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FlexPipe NewFlexPipe(
	Connector connector1,
	Connector connector2,
	FlexPipeType pipeType
)
Public Function NewFlexPipe (
	connector1 As Connector,
	connector2 As Connector,
	pipeType As FlexPipeType
) As FlexPipe
public:
FlexPipe^ NewFlexPipe(
	Connector^ connector1,
	Connector^ connector2,
	FlexPipeType^ pipeType
)
member NewFlexPipe :
        connector1 : Connector *
        connector2 : Connector *
        pipeType : FlexPipeType -> FlexPipe
Parameters
connector1 Connector
 The first connector to be connected to the pipe.
connector2 Connector
 The second connector to be connected to the pipe.
pipeType FlexPipeType
 The type of the flexible pipe.
Return Value
FlexPipe
 If creation was successful then a new flexible pipe is returned, otherwise an exception with failure information will be thrown.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the input argument connector1 or connector2 is null.
InvalidOperationException |  Thrown when the flexible pipe cannot be created or regenerate fails.
ArgumentException | Thrown if the flexible pipe type does not exist in the given document.
Remarks
If the connectors are fitting or equipment connectors of the correct domain, and if the connectors' direction match the direction of the flexible pipe to be created, the connectors will be automatically connected. A transition fitting will be added at the connector(s) if necessary. If the connector's type, domain, does not match the one of the input connectors, no connection will be established.
See Also
Reference
Document Class
NewFlexPipe Overload
Autodesk.Revit.Creation Namespace